/**
  ******************************************************************************
  * @file    Bsp/ad_control.c 
  * @author  cbf
  * @version V0.0.0
  * @date    7-7-2019
  * @brief   function control by gpio
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
#include "utils.h"


void DELAY_MS(uint16_t cnt_ms)
{
    for(uint16_t i = cnt_ms; i >0; i--)
    {
        uint16_t us_cnt = 2000;  
        while(us_cnt--);
    }
}

uint16_t TimingDelay;           //定义全局变量
//-----------------------------------------------------------------------------
void delay_us(uint8_t us)       //定时US函数     
{
	do
	{
        nop();nop();nop();nop();
    }while(--us);	
}

//-----------------------------------------------------------------------------
void TimingDelay_Decrement(void)//定时MS函数
{
    if(TimingDelay != 0x00)     //如果不为0，循环执行
    { 
        TimingDelay--;          //如果不为0，作减法
    }
}

//-----------------------------------------------------------------------------
void delay_ms(uint16_t nTime)   //延时1MS循环
{
    TimingDelay = nTime;
    while(TimingDelay != 0);
}

/*******************************************************************************
****函数备注：中位值滤波函数
*******************************************************************************/
float filter(float *p,uint8_t n)
{
 	uint8_t i=0,j=0;
	float temp=0;

	for(j=0;j<n-1;j++)
	{
		for(i=0;i<n-j-1;i++)
		{
			if(p[i] > p[i+1])
			{
				temp = p[i];p[i] = p[i+1];
                p[i+1] = temp;
			}
		}
	}
	return (float)((p[N/2]+p[N/2-1])/2);
}

/*******************************************************************************
****函数备注：十进制分离函数
*******************************************************************************/
void Separ_ulong(uint32_t dat, uint8_t *p)
{										 	
	*p++ = dat/10000000;
	*p++ = dat%10000000/1000000;
	*p++ = dat%1000000/100000;
	*p++ = dat%100000/10000;
	*p++ = dat%10000/1000;
	*p++ = dat%1000/100;
	*p++ = dat%100/10;
	*p++ = dat%10;
}




/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
